app/views/type_expenses/_form.html.erb

    <%= f.label :category %><br />
    <%= f.collection_select :category_expense_id, CategoryExpense.all,:id, :name, :prompt => true %>
---
SELECT "category_expenses".* FROM "category_expenses"