app/controllers/category_expenses_controller.rb

  def index
    @category_expenses = CategoryExpense.all
---
SELECT "category_expenses".* FROM "category_expenses"

  def show
    @category_expense = CategoryExpense.find(params[:id])
---
SELECT "category_expenses".* FROM "category_expenses" WHERE ("category_expenses"."id" = 1) LIMIT 1

  def create
    @category_expense = CategoryExpense.new(params[:category_expense])
    if @category_expense.save
---
INSERT INTO "category_expenses" ("name", "updated_at", "description", "created_at") VALUES ('Category 1', '2011-03-26 16:16:53.496949', 'First', '2011-03-26 16:16:53.496949')

  def edit
    @category_expense = CategoryExpense.find(params[:id])
---
SELECT "category_expenses".* FROM "category_expenses" WHERE ("category_expenses"."id" = 298486374) LIMIT 1