app/controllers/expenses_controller.rb

SELECT "expenses".* FROM "expenses" WHERE ("expenses"."id" = 1) LIMIT 1
---
  def show
    @expense = Expense.find(params[:id])

INSERT INTO "expenses" ("updated_at", "created_at", "description", "amount", "vat") VALUES ('2011-03-26 16:15:07.314451', '2011-03-26 16:15:07.314451', 's', 0.0, 'f')
---
  def create
    @expense = Expense.new(params[:expense])
    if @expense.save

SELECT "expenses".* FROM "expenses" WHERE ("expenses"."id" = 1) LIMIT 1
---
  def edit
    @expense = Expense.find(params[:id])

SELECT "expenses".* FROM "expenses" WHERE ("expenses"."id" = 980190962) LIMIT 1
UPDATE "expenses" SET "type_expense_id" = 298486374, "updated_at" = '2011-03-26 19:09:57.489344' WHERE ("expenses"."id" = 298486374)
---
  def update
    @expense = Expense.find(params[:id])
    if @expense.update_attributes(params[:expense])