app/controllers/type_expenses_controller.rb

SELECT "type_expenses".* FROM "type_expenses"
---
  def index
    @type_expenses = TypeExpense.all

SELECT "type_expenses".* FROM "type_expenses" WHERE ("type_expenses"."id" = 1) LIMIT 1
---
  def show
    @type_expense = TypeExpense.find(params[:id])

INSERT INTO "type_expenses" ("description", "name", "created_at", "updated_at") VALUES ('This type is made only for trips', 'Trip', '2011-03-26 16:16:16.478150', '2011-03-26 16:16:16.478150')
---
  def create
    @type_expense = TypeExpense.new(params[:type_expense])
    if @type_expense.save

SELECT "type_expenses".* FROM "type_expenses" WHERE ("type_expenses"."id" = 1) LIMIT 1
---
  def edit
    @type_expense = TypeExpense.find(params[:id])

SELECT "type_expenses".* FROM "type_expenses" WHERE ("type_expenses"."id" = 1) LIMIT 1
UPDATE "type_expenses" SET "updated_at" = '2011-03-26 19:07:16.478277', "category_expense_id" = 980190962 WHERE ("type_expenses"."id" = 980190962)
---
  def update
    @type_expense = TypeExpense.find(params[:id])
    if @type_expense.update_attributes(params[:type_expense])