app/views/expenses/_form.html.erb

    <%= f.label :Type %><br />
    <%= f.collection_select :type_expense_id, TypeExpense.all,:id, :name, :prompt => true %>
---
SELECT "type_expenses".* FROM "type_expenses"